Финансы/src/Reports/ДвиженияДенежныхСредств/ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДвиженияДенежныхСредств</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДвижения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Report>

Финансы/src/Reports/ДвиженияДенежныхСредств/ObjectModule.bsl
Процедура УстановитьПараметрКомпоновки(СтрИмяПараметраКомпоновки, ЗначениеПараметраКомпоновки, ИспользованиеПараметраКомпоновки = Истина)
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(СтрИмяПараметраКомпоновки));
	Параметр.Значение = ЗначениеПараметраКомпоновки;
	Параметр.Использование = ИспользованиеПараметраКомпоновки;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	УстановитьПараметрКомпоновки("НачалоПериода", НачалоДня(НачалоПериода));
	УстановитьПараметрКомпоновки("КонецПериода", КонецДня(КонецПериода));
	УстановитьПараметрКомпоновки("ОтборСчетУчета", Ложь);
	Если ЗначениеЗаполнено(СчетУчета) Тогда
		УстановитьПараметрКомпоновки("ОтборСчетУчета", Истина);
		УстановитьПараметрКомпоновки("СчетУчета", СчетУчета);
	КонецЕсли;
	УстановитьПараметрКомпоновки("ОтборВалютаДвижения", Ложь);
	Если ЗначениеЗаполнено(ВалютаДвижения) Тогда
		УстановитьПараметрКомпоновки("ОтборВалютаДвижения", Истина);
		УстановитьПараметрКомпоновки("ВалютаДвижения", ВалютаДвижения);
	КонецЕсли;
	УстановитьПараметрКомпоновки("ОтборСтатьяДоходовРасходов", Ложь);
	Если ЗначениеЗаполнено(СтатьяДоходовРасходов) Тогда
		УстановитьПараметрКомпоновки("ОтборСтатьяДоходовРасходов", Истина);
		УстановитьПараметрКомпоновки("СтатьяДоходовРасходов", СтатьяДоходовРасходов);
	КонецЕсли;
	
	ЗаголовокОтчета = КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Заголовок"));
	ЗаголовокОтчета.Значение = "Движения денежных средств за период с " + Формат(НачалоПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(КонецПериода, "ДФ=dd.MM.yyyy");
	
	// Сформируем отчет
	
	Настройки = КомпоновщикНастроек.Настройки;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// Инициализируем процессор СКД
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	// Инициализируем процессор вывода
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
